# [문제] H&M 고객 데이터(customer_hm.csv) — 기본 전처리 & 인덱싱/슬라이싱
> **주의:** 아래 문제는 반드시 제공된 문법 안에서만 풀이하세요.
- 사용 가능: `read_csv`, `to_csv`, `Series`, `DataFrame`, `head`, `shape`, `info`, `describe`, `value_counts`
- 인덱싱/슬라이싱: `[]`, `[['col1','col2']]`, `.loc`, `.iloc`, 슬라이싱(끝 포함/제외), 불리언 필터, `&`, `|`
- 결측치: `isnull().sum()`

## 0) 환경 세팅
- 파일 경로: `customer_hm.csv`
- 열(예시): `customer_id`, `FN`, `Active`, `club_member_status`, `fashion_news_frequency`, `age`

In [117]:

import pandas as pd

df = pd.read_csv('customer_hm.csv')
print("로드 완료!")

로드 완료!

- `customer_id` : 전처리가 반드시 필요하겠다...... 
- `FN` : 클럽에 가입한 사람
- `Active` : 활성고객
- `club_member_status` : 클럽에 가입한 사람 회원인 사람?
- `fashion_news_frequency`: 패션뉴스 알림 여부였나 (아.... 아무리 떠올려봐도 이미 본 데이터라 어떻게 해야할지 모르겟네)
- `age` : 나이 (뭐 나중에 나이대대로 그룹화를 해야겠다 정도)

사실 내 개인 프로젝트라고 생각하면 가장 관심있는 건 탈퇴고객이라서
혼자 복습할 때는 그거 위주로 하려고

### 문제 1. 데이터 처음 5행을 확인하세요 (`head()`).

In [118]:
df.head()

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52

### 문제 2. 데이터의 행, 열 개수를 확인하세요 (`shape`).

In [119]:
df.shape

(1048575, 6)

### 문제 3. 각 컬럼의 타입과 결측치를 포함한 요약 정보를 확인하세요 (`info()`).

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 6 columns):
 #   Column                  Non-Null Count    Dtype
---  ------                  --------------    -----
 0   customer_id             1048575 non-null  object
 1   FN                      1048575 non-null  int64
 2   Active                  1048575 non-null  int64
 3   club_member_status      1048575 non-null  object
 4   fashion_news_frequency  1048574 non-null  object
 5   age                     1048575 non-null  int64
dtypes: int64(3), object(3)
memory usage: 48.0+ MB

### 문제 4. 수치형 컬럼들의 통계 요약을 확인하세요 (`describe()`).

In [121]:
df.describe()
df.describe().round(1)      #그러네 round 쓰면 되는구나 생각해보니까

              FN     Active        age
count  1048575.0  1048575.0  1048575.0
mean         0.4        0.3       36.4
std          0.5        0.5       14.3
min          0.0        0.0       16.0
25%          0.0        0.0       24.0
50%          0.0        0.0       32.0
75%          1.0        1.0       49.0
max          1.0        1.0       99.0

In [122]:
df.describe().T     #행렬을 뒤집어잇~

            count       mean        std   min   25%   50%   75%   max
FN      1048575.0   0.355540   0.478677   0.0   0.0   0.0   1.0   1.0
Active  1048575.0   0.346133   0.475736   0.0   0.0   0.0   1.0   1.0
age     1048575.0  36.369194  14.308991  16.0  24.0  32.0  49.0  99.0

In [123]:
df['age'].describe().round()

count    1048575.0
mean          36.0
std           14.0
min           16.0
25%           24.0
50%           32.0
75%           49.0
max           99.0
Name: age, dtype: float64

In [124]:
#아맞다 결측치
df.isnull().sum()

customer_id               0
FN                        0
Active                    0
club_member_status        0
fashion_news_frequency    1
age                       0
dtype: int64

### 문제 5. `customer_id`, `age`, `club_member_status` 열만 선택해 처음 5행을 출력하세요 (`[['col1','col2']]`).

In [125]:
df[['customer_id', 'age', 'club_member_status']].head()

# [[]] 하면 된다는데 왜인지는 까먹음 헤헤 암튼 풀었다
#안쪽 대괄호는 리스트, 바깥은 인덱스 호출 그래서 df로 옴

                                         customer_id  age club_member_status
0  00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...   49             ACTIVE
1  0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...   25             ACTIVE
2  000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...   24             ACTIVE
3  00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...   54             ACTIVE
4  00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...   52             ACTIVE

### 문제 6. `age` 한 열만 선택했을 때와 두 중괄호로 선택했을 때의 차이를 확인하세요 (`Series vs DataFrame`).

In [126]:
df['age']  #.info() 했을 때 Series (시리즈는 인덱스 + 값의 1차원)
df[['age']] #DataFrame (안쪽 []는 리스트로 오는 거고(형식그대로), 바깥꽃 []는 인덱싱 호출) / df는 2차원(행+열)

         age
0         49
1         25
2         24
3         54
4         52
...      ...
1048570   22
1048571   41
1048572   38
1048573   54
1048574   49

[1048575 rows x 1 columns]

### 문제 7. `.loc`으로 0~5행(끝 포함)과 `['customer_id','club_member_status','age']` 열을 선택해 보세요.

In [127]:
df.loc[0:5, ['customer_id','club_member_status','age']]

                                         customer_id club_member_status  age
0  00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...             ACTIVE   49
1  0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...             ACTIVE   25
2  000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...             ACTIVE   24
3  00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...             ACTIVE   54
4  00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...             ACTIVE   52
5  0000757967448a6cb83efb3ea7a3fb9d418ac7adf2379d...             ACTIVE   20

In [128]:
df.loc[4:6, ['fashion_news_frequency', 'age']]

  fashion_news_frequency  age
4              Regularly   52
5                   NONE   20
6              Regularly   32

### 문제 8. `.iloc`으로 0~6행(끝 제외)과 열 위치 `[0,1,2,5]`를 선택해 보세요.

In [129]:
df.iloc[0:6, [0,1,2,5]]

                                         customer_id  FN  Active  age
0  00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...   0       0   49
1  0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...   0       0   25
2  000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...   0       0   24
3  00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...   0       0   54
4  00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...   1       1   52
5  0000757967448a6cb83efb3ea7a3fb9d418ac7adf2379d...   0       0   20

In [130]:
df.head(8)

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52
5,0000757967448a6cb83efb3ea7a3fb9d418ac7adf2379d...,0,0,ACTIVE,NONE,20
6,00007d2de826758b65a93dd24ce629ed66842531df6699...,1,1,ACTIVE,Regularly,32
7,00007e8d4e54114b5b2a9b51586325a8d0fa74ea23ef77...,0,0,ACTIVE,NONE,20

In [131]:
df.iloc[4:7, [4,5]]

  fashion_news_frequency  age
4              Regularly   52
5                   NONE   20
6              Regularly   32

In [132]:
df.iloc[4:7, 4:6]

  fashion_news_frequency  age
4              Regularly   52
5                   NONE   20
6              Regularly   32

In [133]:
# df.iloc[4:7, [[4:6]]]

In [134]:
import numpy as np
df.iloc[0:7, np.r_[0:2, 4]] #이렇게 돌려돌려는 쓸 수 있다(알 필요까진 없음)

,customer_id,FN,fashion_news_frequency
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,NONE
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,NONE
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,NONE
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,NONE
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,Regularly
5,0000757967448a6cb83efb3ea7a3fb9d418ac7adf2379d...,0,NONE
6,00007d2de826758b65a93dd24ce629ed66842531df6699...,1,Regularly

### 문제 9. 불리언 필터로 `age >= 50`인 행만 선택하고 `['customer_id','age','Active']` 열만 보세요.

In [135]:
#불리언 필터
#불리언 시리즈 / 불리언 df
# 조건식에 넣으면 만족하는(True) 값만 가져오니까 결국 True인 행만 남는다

df_age = df.loc[df['age'] >= 50, ['customer_id','age','Active']]
df_age
#df['age']가 >= 50인(이게 True인) customer_id, agee, Active 컬럼으로 보여줘? 에서 뽑아줘?

                                               customer_id  age  Active
3        00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...   54       0
4        00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...   52       1
12       00009d946eec3ea54add5ba56d5210ea898def4b46c685...   56       1
14       0000b2f1829e23b24feec422ef13df3ccedaedc85368e6...   54       1
15       0000b7a134c3ec0d8842fad1fd4ca28517424c14fc4848...   75       0
...                                                    ...  ...     ...
1048555  c88ed14b441c956cad259d9ec588fa0e62a53f38c85f8b...   57       1
1048559  c88edd334619bcbb99a989a9897fb58f8048c5432edd35...   64       0
1048560  c88ee2bf9eff1dd1f88e0660e700c536e2d5d32662abd1...   52       0
1048561  c88ef06636e7b60623be92eff392af29d3271eed02fb57...   52       0
1048573  c88fa15c06519c4bdcab386fea313b226113584b729874...   54       1

[245566 rows x 3 columns]

In [136]:
# mask = df.loc[df]

### 문제 10. 복합 조건으로 `Active == 1` AND `fashion_news_frequency == 'Regularly'`인 행을 선택하고 `['customer_id','fashion_news_frequency','age']`만 보세요.

In [137]:
# conditions = (df['Active' == 1]) & (df['fashion_news_frequency' == 'Regularly'])
# df[conditions]

# #cpnditions = 조건 (조건은 ()로, & 연산자로 묶었음)

In [138]:
# conditions2 = (df['Club_member_status'] == 'Active') | ((df['FN'] == 0) & (df['age'] >= 35))
# df[conditions2]

In [139]:
conditions = (df['Active'] == 1) & (df['fashion_news_frequency'] == 'Regularly')
df.loc[conditions, ['customer_id','fashion_news_frequency','age']].head()

### 복습 필요 이거...

,customer_id,fashion_news_frequency,age
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,Regularly,52
6,00007d2de826758b65a93dd24ce629ed66842531df6699...,Regularly,32
12,00009d946eec3ea54add5ba56d5210ea898def4b46c685...,Regularly,56
13,0000ae1bbb25e04bdc7e35f718e852adfb3fbb72ef38b3...,Regularly,29
14,0000b2f1829e23b24feec422ef13df3ccedaedc85368e6...,Regularly,54

### 문제 11. 범주형 컬럼 `club_member_status`의 분포를 확인하세요 (`value_counts()`).

In [140]:
df['club_member_status'].value_counts()

club_member_status
ACTIVE        982635
PRE-CREATE     65581
LEFT CLUB        359
Name: count, dtype: int64

### 문제 12. 컬럼별 결측치 개수를 확인하세요 (`isnull().sum()`).

In [141]:
df.isnull().sum()   # zzz 옛날거라고 하시네 나는 isna가 더 예전거인줄 r에서 썼어서

df.isna().sum()

customer_id               0
FN                        0
Active                    0
club_member_status        0
fashion_news_frequency    1
age                       0
dtype: int64

### 문제 13. `age >= 18`인 행만 골라 `output/hm_adults.csv`로 저장하세요 (`to_csv`).

In [ ]:
# # pd.to_csv('output/hm_adults.csv', df[age] >= 18)    #어 이게 아니네

# adc = df[df['age'] >= 18]
# adc
# csv.to_csv('output/hm_adults.csv')

    # output 폴더가 안되는 거였음 그냥 파일이름으로만 저장하면 됨. 아마 r.하면 될수도 ? 근데 일단 끝
        # adc는 뭔 adc여 캐리형원딜이야? abc라고 하려고 했는데 나도 모르게....

In [ ]:
df[df['age'] >= 18]
df.loc[df['age'] >= 18] #결과는 같은데 특정 열을 선택할 때는 조금 불안정함(.loc은 안전, 안쓴 게 불안전)

0    49
1    25
2    24
3    54
4    52
Name: age, dtype: int64

In [157]:
result_df = df.loc[df['age'] >= 18]
result_df.to_csv('hm_adults.csv', index=False)   #인덱스를 컬럼으로 추가 안한다는 것

In [158]:
df = pd.read_csv('hm_adults.csv')

In [159]:
df.head()

,customer_id,FN,Active,club_member_status,fashion_news_frequency,age
0,00000dbacae5abe5e23885899a1fa44253a17956c6d1c3...,0,0,ACTIVE,NONE,49
1,0000423b00ade91418cceaf3b26c6af3dd342b51fd051e...,0,0,ACTIVE,NONE,25
2,000058a12d5b43e67d225668fa1f8d618c13dc232df0ca...,0,0,ACTIVE,NONE,24
3,00005ca1c9ed5f5146b52ac8639a40ca9d57aeff4d1bd2...,0,0,ACTIVE,NONE,54
4,00006413d8573cd20ed7128e53b7b13819fe5cfc2d801f...,1,1,ACTIVE,Regularly,52

In [160]:
df['age'].head()

0    49
1    25
2    24
3    54
4    52
Name: age, dtype: int64